AM Wick/600um/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-0.0003 -0.00032 -0.0003)
    (0.0003 -0.00032 -0.0003)
    (0.0003 0.0003 -0.0003)
    (-0.0003  0.0003 -0.0003)
    (-0.0003 -0.00032  0.0003)
    (0.0003 -0.00032  0.0003)
    (0.0003  0.0003  0.0003)
    (-0.0003  0.0003 0.0003)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) (15 10 10) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (60 62 60) simpleGrading (1 1 1)
);

edges
();

boundary        
(
    minX
    {
        type symmetryPlane;
	faces
	( 
            (0 4 7 3)
	);
    }

    maxX
    {
        type symmetryPlane;
	faces
	( 
            (2 6 5 1)
	);
    }

    minY
    {
        type  patch;
	faces
	( 
            (1 5 4 0)
	);
    }

    maxY 
    {
        type  patch;
	faces
	( 
            (3 7 6 2)
	);
    }

    minZ
    {
        type  symmetryPlane;
	faces
	( 
            (0 3 2 1)
	);
    }

    maxZ
    {
        type symmetryPlane;
	faces
	( 
            (4 5 6 7)
	);
    }
);

// ************************************************************************* //
